# 1 ére étape : importation des bibliothèques

In [31]:
import pandas as pd
import psycopg2
import sqlalchemy
import random
from sqlalchemy import create_engine
import pandas as pd
from datetime import datetime

# 2 ème étape : Etablissement de connexion à la base de données PostgreSQL

In [27]:
conn = psycopg2.connect(
    host='localhost',
    user='postgres',
    password='admin',
    database ='Web_App_GoldenLine')

In [28]:
engine = create_engine('postgresql+psycopg2://postgres:admin\
@localhost/Web_App_GoldenLine')

In [29]:
# declare the connection string specifying

conn_string = "host='localhost' dbname='Web_App_GoldenLine'\
user='postgres' password='admin'"

# use connect function to establish the connection
conn = psycopg2.connect(conn_string)

# 3 ème étape : Lecture des données dans Dataframe Pandas

In [5]:
# lecture des données d'une table PostgreSQL dans un DataFrame Pandas.
# Cela signifie qu'on récupére les données de la table "Role" de notre 
# base de données à l'aide de la connexion crée avec l'objet engine 
# et les stockez dans le DataFrame df.

df = pd.read_sql("Role" , engine)
df1 = pd.read_sql("User", engine)
df2 = pd.read_sql("Transaction", engine)
df3 = pd.read_sql("Categorie", engine)
df4 = pd.read_sql("Collecte", engine)
df5 = pd.read_sql("Données_anonymisées_client", engine)

In [6]:
df

Empty DataFrame
Columns: [id_role, nom]
Index: []

In [7]:
df1

Empty DataFrame
Columns: [id_user, nom_user, prenom_user, email, password, gsm, nbr_enfant, class_socioprofessionnelle, ville_user, id_role]
Index: []

In [8]:
df2

Empty DataFrame
Columns: [id_transaction, montant_achat, date_passage, id_user]
Index: []

In [9]:
df3

Empty DataFrame
Columns: [id_categorie, categorie_achat1, categorie_achat2, prix_categorie1, prix_categorie2, id_transaction]
Index: []

In [10]:
df4

Empty DataFrame
Columns: [identifiant_collecte, categorie_achat1, categorie_achat2, prix_categorie1, prix_categorie2]
Index: []

In [11]:
df5

Empty DataFrame
Columns: [id_user, role, class_socioprofessionnelle, nbr_enfant, ville_user, montant_achat, date_passage, identifiant_collecte]
Index: []

# 4 ème étape : Ecrire des données dans DF

# Methode 1: ecrire les données dans DF avec affichage et renvoie vers DB postgres

In [12]:

# Ecrie data dans df 

df = pd.DataFrame({
    'nom' : ["admin","marketing","client",]
})

In [13]:
df

         nom
0      admin
1  marketing
2     client

In [14]:
# Renvoie df vers DB potgres

df.to_sql('Role', engine, if_exists = 'append', index= False)

3

In [15]:
#retrive data (si la fct df.to_sql est non exécuté printing row cesse de fonctionner sans afficher des erreurs )

# cursor

pgcursor = conn.cursor()

# retrive data for DB
pgcursor.execute ('SELECT * FROM "Role"')

for row in pgcursor.fetchall():
   print(row)

(1, 'admin')
(2, 'marketing')
(3, 'client')

In [16]:

# Ecrie data dans df1


df1 = pd.DataFrame({
    'nom_user': ["Renuy", "Dupond"],
    'prenom_user':["Gregory","José"],
    'email': ["Gregory.renuy@commande.fr","JoséDupond@com.net"],
    'password' : ["azedfgh", "ngrgjg"],
    'gsm' :["0123654","01789632" ],
    'nbr_enfant' :[5,2],
    'class_socioprofessionnelle' :["Ouvrier", "Medecin"],
    'ville_user': ["Marseille", "Nice"],
    'id_role' : [3,3]
})

In [17]:
df1

,nom_user,prenom_user,email,password,gsm,nbr_enfant,class_socioprofessionnelle,ville_user,id_role
0,Renuy,Gregory,Gregory.renuy@commande.fr,azedfgh,0123654,5,Ouvrier,Marseille,3
1,Dupond,José,JoséDupond@com.net,ngrgjg,01789632,2,Medecin,Nice,3

In [18]:
# Renvoie df vers DB potgres

df1.to_sql('User', engine, if_exists = 'append', index= False)

2

In [19]:

# Ecrie data dans df2 


df2 = pd.DataFrame({
    'montant_achat' : [120,50,],
    'date_passage' : [datetime.now(),datetime.now()],
    'id_user' : [1, 2]
})

In [20]:
df2

   montant_achat               date_passage  id_user
0            120 2023-10-17 18:23:54.737623        1
1             50 2023-10-17 18:23:54.737623        2

In [21]:
# Renvoie df vers DB potgres

df2.to_sql('Transaction', engine, if_exists = 'append', index= False)

2

In [22]:
# Ecrie data dans df

df3 = pd.DataFrame({
    'categorie_achat1' : ["Enfant","alimentaire"],
    'categorie_achat2' : ["Adolescent","multimédia"],
    'prix_categorie1' : [60, 25],
    'prix_categorie2' : [60,25],
    'id_transaction' : [1,2]
})

In [23]:
df3

,categorie_achat1,categorie_achat2,prix_categorie1,prix_categorie2,id_transaction
0,Enfant,Adolescent,60,60,1
1,alimentaire,multimédia,25,25,2

In [24]:
# Renvoie df vers DB potgres

df3.to_sql('Categorie', engine, if_exists = 'append', index= False)

2

In [51]:
import pandas as pd
from sqlalchemy import create_engine

# Replace the connection string with your own PostgreSQL connection details
#DATABASE_URL = "postgresql://user:password@localhost/database_name"

engine = create_engine('postgresql+psycopg2://postgres:admin\
@localhost/Web_App_GoldenLine')

# Create a SQLAlchemy engine
#engine = create_engine(DATABASE_URL)

In [52]:
import psycopg2
import pandas as pd

# Replace the connection details with your own
conn = psycopg2.connect(
    host='localhost',
    user='postgres',
    password='admin',
    database ='Web_App_GoldenLine')

In [54]:
cur = conn.cursor()
cur.execute(create_table_query)
conn.commit()
cur.close()

In [47]:
df4

Empty DataFrame
Columns: [identifiant_collecte, categorie_achat1, categorie_achat2, prix_categorie1, prix_categorie2]
Index: []

In [57]:
df

         nom
0      admin
1  marketing
2     client

In [58]:
df1

,nom_user,prenom_user,email,password,gsm,nbr_enfant,class_socioprofessionnelle,ville_user,id_role
0,Renuy,Gregory,Gregory.renuy@commande.fr,azedfgh,0123654,5,Ouvrier,Marseille,3
1,Dupond,José,JoséDupond@com.net,ngrgjg,01789632,2,Medecin,Nice,3

In [59]:
df2

   montant_achat               date_passage  id_user
0            120 2023-10-17 18:23:54.737623        1
1             50 2023-10-17 18:23:54.737623        2

In [61]:
df3

,categorie_achat1,categorie_achat2,prix_categorie1,prix_categorie2,id_transaction
0,Enfant,Adolescent,60,60,1
1,alimentaire,multimédia,25,25,2

In [68]:

# Assuming df, df1, df2, and df3 are your dataframes
# Concatenate the dataframes into a single dataframe

combined_df = pd.concat([df, df1, df2, df3], ignore_index=True)


# Assuming df, df1, df2, and df3 are your dataframes
with pd.ExcelWriter('combined_data.xlsx', engine='xlsxwriter') as writer:
    df.to_excel(writer, sheet_name='Role', index=False)
    df1.to_excel(writer, sheet_name='User', index=False)
    df2.to_excel(writer, sheet_name='Transaction', index=False)
    df3.to_excel(writer, sheet_name='Categorie', index=False)

# Save the combined dataframe to a CSV file
combined_df.to_csv('combined_data.csv', index=False)


# Exporter le DataFrame vers un fichier Excel
df.to_excel("Web_App_GoldenLine.xlsx", index=False)  # Changez "donnees.xlsx" au nom de votre fichier Excel

# Fermer la connexion à la base de données
conn.close()

In [69]:
import os
import pandas as pd

# Specify the file names
csv_file = 'combined_data.csv'
excel_file = 'combined_data.xlsx'

# Determine the current working directory
current_directory = os.getcwd()

# Create absolute file paths
csv_file_path = os.path.join(current_directory, csv_file)
excel_file_path = os.path.join(current_directory, excel_file)

# Assuming df, df1, df2, and df3 are your dataframes
combined_df = pd.concat([df, df1, df2, df3], ignore_index=True)

# Save to CSV and Excel files using the specified file paths
combined_df.to_csv(csv_file_path, index=False)
with pd.ExcelWriter(excel_file_path, engine='xlsxwriter') as writer:
    df.to_excel(writer, sheet_name='Role', index=False)
    df1.to_excel(writer, sheet_name='User', index=False)
    df2.to_excel(writer, sheet_name='Transaction', index=False)
    df3.to_excel(writer, sheet_name='Categorie', index=False)

print(f"CSV file saved to: {csv_file_path}")
print(f"Excel file saved to: {excel_file_path}")

CSV file saved to: C:\Windows\System32\combined_data.csv
Excel file saved to: C:\Windows\System32\combined_data.xlsx